Revit 2027 API
BuiltInFailures.DesignOptionFailures.CannotAddToOptions Property
 Elements can't be added to Option Set
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotAddToOptions { get; }
Public Shared ReadOnly Property CannotAddToOptions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotAddToOptions {
	FailureDefinitionId^ get ();
}
static member CannotAddToOptions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace